<a href="https://colab.research.google.com/github/Aman2125/Numpy_CampusX_Practice/blob/main/4)aman_Pandas_Series.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#What is Pandas?
Pandas is a fast,powerful,flexible and easy to use open source data analysis and manipulation tool,built on top of the python programming language.



#Pandas Series
A Pandas Series is like a column in a table. It is a 1-D array holding data of any type.



#Importing Pandas

In [2]:
import numpy as np
import pandas as pd

#Making Series from Lists

In [4]:
#string
country = ['India' , 'Nepal' ,'Bhutan' , 'Kazakastan' ]
pd.Series(country) #output is index and its value

0         India
1         Nepal
2        Bhutan
3    Kazakastan
dtype: object

In [5]:
#integer
runs = [13,44,23,66,76,87,89]
pd.Series(runs)

0    13
1    44
2    23
3    66
4    76
5    87
6    89
dtype: int64

In [6]:
#custom index
marks =[56,87,97,54]
subjects = ['English' , 'Maths' , 'CS' , 'Sanskrit']
pd.Series(marks , index = subjects)

English     56
Maths       87
CS          97
Sanskrit    54
dtype: int64

In [7]:
#setting a name to series
marks =pd.Series(marks , index = subjects , name='Aman ke marks')
marks

English     56
Maths       87
CS          97
Sanskrit    54
Name: Aman ke marks, dtype: int64

#Series from Dict

In [8]:
marks ={
    'maths' : 98,
    'Science': 87,
    'English':82,
    'Hindi':88
}

marks_series = pd.Series(marks , name = 'Aman ke marks')
marks_series

maths      98
Science    87
English    82
Hindi      88
Name: Aman ke marks, dtype: int64

#Series Attributes

In [9]:
#size , tells size of the series
marks_series.size

4

In [10]:
#dtype , tells the data type of the item in the series
marks_series.dtype

dtype('int64')

In [11]:
#name
marks_series.name

'Aman ke marks'

In [12]:
#is_unique , check all vale have unique el or not
marks_series.is_unique

True

In [13]:
#index , gives all the index element
marks_series.index

Index(['maths', 'Science', 'English', 'Hindi'], dtype='object')

In [14]:
#values , gives all the values(numpy array)
marks_series.values

array([98, 87, 82, 88])

#Series using read_csv

In [16]:
#with one col
subs = pd.read_csv('/content/subs.csv').squeeze()  #stores in form of data frame not in series you can check by adding type
#to check in form of series we use squeeze function
subs

0       48
1       57
2       40
3       43
4       44
      ...
360    231
361    226
362    155
363    144
364    172
Name: Subscribers gained, Length: 365, dtype: int64

In [17]:
#with 2 col
vk = pd.read_csv('/content/kohli_ipl.csv' ,index_col = 'match_no').squeeze()
vk

match_no
1       1
2      23
3      13
4      12
5       1
       ..
211     0
212    20
213    73
214    25
215     7
Name: runs, Length: 215, dtype: int64

In [18]:
movies = pd.read_csv('/content/bollywood.csv' , index_col = 'movie').squeeze()
movies

movie
Uri: The Surgical Strike                   Vicky Kaushal
Battalion 609                                Vicky Ahuja
The Accidental Prime Minister (film)         Anupam Kher
Why Cheat India                            Emraan Hashmi
Evening Shadows                         Mona Ambegaonkar
                                              ...
Hum Tumhare Hain Sanam                    Shah Rukh Khan
Aankhen (2002 film)                     Amitabh Bachchan
Saathiya (film)                             Vivek Oberoi
Company (film)                                Ajay Devgn
Awara Paagal Deewana                        Akshay Kumar
Name: lead, Length: 1500, dtype: object

#Series Methods

In [19]:
#head and tail , give preview of head and tail of the data
subs.head() #by default give top 5 row

0    48
1    57
2    40
3    43
4    44
Name: Subscribers gained, dtype: int64

In [20]:
vk.head(3) #giving number by which we want

match_no
1     1
2    23
3    13
Name: runs, dtype: int64

In [21]:
vk.tail() #gives last 5 row data by default

match_no
211     0
212    20
213    73
214    25
215     7
Name: runs, dtype: int64

In [22]:
#sample , randomly gives one row from the data
movies.sample()
#movies.sample(5) , for giving 5 random rows

movie
Koyelaanchal    Kannan Arunachalam
Name: lead, dtype: object

In [23]:
#value_counts -> movies
movies.value_counts() # har actor kitna movie kiya bata dega that is the frequency of the values

lead
Akshay Kumar         48
Amitabh Bachchan     45
Ajay Devgn           38
Salman Khan          31
Sanjay Dutt          26
                     ..
Seema Azmi            1
Akanksha Puri         1
Charanpreet Insan     1
Jaideep Ahlawat       1
Monali Thakur         1
Name: count, Length: 566, dtype: int64

In [24]:
#sort_values -> inplace
vk.sort_values(ascending=False) #for desc order , doesnt do the permanent change
#find virat highest score in ipl
vk.sort_values(ascending=False).head(1).values[0]

np.int64(113)

In [25]:
# sort_index -> inplace -> movies
movies.sort_index()

movie
1920 (film)                   Rajniesh Duggall
1920: London                     Sharman Joshi
1920: The Evil Returns             Vicky Ahuja
1971 (2007 film)                Manoj Bajpayee
2 States (2014 film)              Arjun Kapoor
                                   ...
Zindagi 50-50                      Veena Malik
Zindagi Na Milegi Dobara        Hrithik Roshan
Zindagi Tere Naam           Mithun Chakraborty
Zokkomon                       Darsheel Safary
Zor Lagaa Ke...Haiya!            Meghan Jadhav
Name: lead, Length: 1500, dtype: object

#Series Math Methods

In [26]:
#count , count the total number of items just like size but it doesnt count the missing values
vk.count()

np.int64(215)

In [27]:
#sum -> product
subs.sum() #total sum
subs.product()

np.int64(0)

In [28]:
#mean -> median -> mode -> std -> var
subs.mean()
print(vk.median())
print(movies.mode())
print(subs.std())
print(subs.var())

24.0
0    Akshay Kumar
Name: lead, dtype: object
62.67502303725269
3928.1585127201556

In [29]:
#min /max
subs.min()
subs.max()

396

In [30]:
#describe , give the summary of multiple things
vk.describe()

count    215.000000
mean      30.855814
std       26.229801
min        0.000000
25%        9.000000
50%       24.000000
75%       48.000000
max      113.000000
Name: runs, dtype: float64

#Series Indexing

In [31]:
#integer indexing
x = pd.Series([12,13,14,35,46,57,39,59,24])
x[0]

np.int64(12)

In [32]:
#negative indexing
x[-1] #this will gave error , only positive indexing will work

KeyError: -1

In [33]:
movies[0]

/tmp/ipython-input-3901301928.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  movies[0]

'Vicky Kaushal'

In [34]:
#slicing
vk[5:16]

match_no
6      9
7     34
8      0
9     21
10     3
11    10
12    38
13     3
14    11
15    50
16     2
Name: runs, dtype: int64

In [35]:
#negative slicing
vk[-5:]

match_no
211     0
212    20
213    73
214    25
215     7
Name: runs, dtype: int64

In [37]:
movies[-5:]
movies[::2]

movie
Uri: The Surgical Strike                   Vicky Kaushal
The Accidental Prime Minister (film)         Anupam Kher
Evening Shadows                         Mona Ambegaonkar
Fraud Saiyaan                               Arshad Warsi
Manikarnika: The Queen of Jhansi          Kangana Ranaut
                                              ...
Raaz (2002 film)                              Dino Morea
Waisa Bhi Hota Hai Part II                  Arshad Warsi
Kaante                                  Amitabh Bachchan
Aankhen (2002 film)                     Amitabh Bachchan
Company (film)                                Ajay Devgn
Name: lead, Length: 750, dtype: object

In [38]:
#fancy indexing
vk[[1,3,5,7]]

match_no
1     1
3    13
5     1
7    34
Name: runs, dtype: int64

In [40]:
#indexing with labels -> fancy indexing
movies['Hum Tumhare Hain Sanam']

'Shah Rukh Khan'

#Editing Series